```hcl
 # module.dns.aws_route53_record.api[0] must be replaced
-/+ resource "aws_route53_record" "api" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "api.dev.directory.internal.cms.gov" -> (known after apply)
      ~ id                               = "Z066778139RB4JZA6NMCI_api.dev.directory.internal.cms.gov_CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "api.dev.directory.internal.cms.gov" -> "api.dev.cnpd.internal.cms.gov" # forces replacement
      ~ zone_id                          = "Z066778139RB4JZA6NMCI" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.dns.aws_route53_record.directory[0] must be replaced
-/+ resource "aws_route53_record" "directory" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "dev.directory.internal.cms.gov" -> (known after apply)
      ~ id                               = "Z066778139RB4JZA6NMCI_dev.directory.internal.cms.gov_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "dev.directory.internal.cms.gov" -> "dev.cnpd.internal.cms.gov" # forces replacement
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z066778139RB4JZA6NMCI" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dns.aws_route53_record.etl must be replaced
-/+ resource "aws_route53_record" "etl" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "etl.dev.directory.internal.cms.gov" -> (known after apply)
      ~ id                               = "Z066778139RB4JZA6NMCI_etl.dev.directory.internal.cms.gov_CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "etl.dev.directory.internal.cms.gov" -> "etl.dev.cnpd.internal.cms.gov" # forces replacement
      ~ zone_id                          = "Z066778139RB4JZA6NMCI" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.dns.aws_route53_record.ns must be replaced
-/+ resource "aws_route53_record" "ns" {
      + allow_overwrite                  = true
      ~ fqdn                             = "dev.directory.internal.cms.gov" -> (known after apply)
      ~ id                               = "Z066778139RB4JZA6NMCI_dev.directory.internal.cms.gov_NS" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "dev.directory.internal.cms.gov" -> "dev.cnpd.internal.cms.gov" # forces replacement
      ~ records                          = [
          - "ns-1512.awsdns-61.org",
          - "ns-1573.awsdns-04.co.uk",
          - "ns-411.awsdns-51.com",
          - "ns-713.awsdns-25.net",
        ] -> (known after apply)
      ~ ttl                              = 30 -> 172800
      ~ zone_id                          = "Z066778139RB4JZA6NMCI" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.dns.aws_route53_zone.internal_dns must be replaced
-/+ resource "aws_route53_zone" "internal_dns" {
      ~ arn                 = "arn:aws:route53:::hostedzone/Z066778139RB4JZA6NMCI" -> (known after apply)
      ~ id                  = "Z066778139RB4JZA6NMCI" -> (known after apply)
      ~ name                = "dev.directory.internal.cms.gov" -> "dev.cnpd.internal.cms.gov" # forces replacement
      ~ name_servers        = [
          - "ns-1512.awsdns-61.org",
          - "ns-1573.awsdns-04.co.uk",
          - "ns-411.awsdns-51.com",
          - "ns-713.awsdns-25.net",
        ] -> (known after apply)
      ~ primary_name_server = "ns-1512.awsdns-61.org" -> (known after apply)
      - tags                = {} -> null
      ~ tags_all            = {} -> (known after apply)
      ~ zone_id             = "Z066778139RB4JZA6NMCI" -> (known after apply)
        # (3 unchanged attributes hidden)
    }
```